# ActiveAddInId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..ActiveAddInId Property
UIApplication Class See Also
---
Get current active external application or external command id.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AddInId ActiveAddInId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ActiveAddInId As AddInId
	Get
```

Visual C++
---
```text
public:
property AddInId^ ActiveAddInId {
	AddInId^ get ();
}
```

# See Also
UIApplication Class
Autodesk.Revit.UI Namespace